

/*-----------------------------ADC定义及函数说明------------------------------*/

#ifndef __ADC_H
#define __ADC_H

/*-------------------------------包含的头文件---------------------------------*/
#include "stm8s_adc1.h"
#include "stm8s_gpio.h"
/*----------------------------------宏定义------------------------------------*/

/*----------------------------------函数定义----------------------------------*/
static void Adc_Gpio_Init(void);

void Adc1_Init(void);

uint16_t Get_Adc1_Value(ADC1_Channel_TypeDef channel);  

#endif /* __ADC_H */
/*--------------Write-by-xiao-kai-2017-05-06-17-14----QQ-850637704------------*/
/*-------------------------Always-have-a-nice-day-----------------------------*/